Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 1, 13)]              0         
_________________________________________________________________
gru_1 (GRU)                  (1, 1, 400)               498400    
_________________________________________________________________
stream (Stream)              (1, 400)                  400       
_________________________________________________________________
dropout (Dropout)            (1, 400)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  51328     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 586,750
Trainable params: 585,950
Non-trainable params: 800
_________________________________________________________________