Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 49, 40)]        0                                            
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 49, 1, 40)       0           input_audio[0][0]                
__________________________________________________________________________________________________
conv2d (Conv2D)                 (1, 24, 1, 32)       3840        tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (1, 24, 1, 32)       96          conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (1, 24, 1, 32)       0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (1, 24, 1, 48)       1536        re_lu[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (1, 24, 1, 48)       144         conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (1, 24, 1, 48)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
depthwise_conv2d (DepthwiseConv (1, 24, 1, 48)       144         re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (1, 24, 1, 48)       144         depthwise_conv2d[0][0]           
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (1, 24, 1, 48)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (1, 24, 1, 32)       1536        re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (1, 24, 1, 32)       128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (1, 24, 1, 32)       0           re_lu[0][0]                      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (1, 24, 1, 48)       1536        add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (1, 24, 1, 48)       144         conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (1, 24, 1, 48)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (1, 12, 1, 48)       144         re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (1, 12, 1, 48)       144         depthwise_conv2d_1[0][0]         
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (1, 12, 1, 48)       0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (1, 12, 1, 32)       1536        re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (1, 12, 1, 32)       128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (1, 12, 1, 48)       1536        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (1, 12, 1, 48)       144         conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (1, 12, 1, 48)       0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
depthwise_conv2d_2 (DepthwiseCo (1, 12, 1, 48)       144         re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (1, 12, 1, 48)       144         depthwise_conv2d_2[0][0]         
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (1, 12, 1, 48)       0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (1, 12, 1, 64)       3072        re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (1, 12, 1, 64)       256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (1, 12, 1, 96)       6144        batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (1, 12, 1, 96)       288         conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (1, 12, 1, 96)       0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
depthwise_conv2d_3 (DepthwiseCo (1, 12, 1, 96)       288         re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (1, 12, 1, 96)       288         depthwise_conv2d_3[0][0]         
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (1, 12, 1, 96)       0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (1, 12, 1, 64)       6144        re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (1, 12, 1, 64)       256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (1, 12, 1, 64)       0           batch_normalization_9[0][0]      
                                                                 batch_normalization_12[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (1, 64)              0           add_1[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (1, 64)              0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (1, 14)              910         dropout[0][0]                    
==================================================================================================
Total params: 30,814
Trainable params: 29,406
Non-trainable params: 1,408
__________________________________________________________________________________________________