Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 1, 20)]              0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 1, 20, 1)             0         
_________________________________________________________________
stream (Stream)              (1, 1, 18, 64)            700       
_________________________________________________________________
stream_1 (Stream)            (1, 1, 16, 64)            67264     
_________________________________________________________________
stream_2 (Stream)            (1, 1, 14, 64)            66624     
_________________________________________________________________
stream_3 (Stream)            (1, 1, 12, 64)            65984     
_________________________________________________________________
stream_4 (Stream)            (1, 1, 11, 128)           85888     
_________________________________________________________________
stream_5 (Stream)            (1, 1, 11, 64)            48064     
_________________________________________________________________
stream_6 (Stream)            (1, 1, 11, 128)           26816     
_________________________________________________________________
stream_7 (Stream)            (1, 1408)                 1408      
_________________________________________________________________
dropout (Dropout)            (1, 1408)                 0         
_________________________________________________________________
dense (Dense)                (1, 128)                  180352    
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 579,722
Trainable params: 549,902
Non-trainable params: 29,820
_________________________________________________________________