Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 1, 40)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 1, 40, 1)        0           input_audio[0][0]                
__________________________________________________________________________________________________
stream (Stream)                 (1, 1, 38, 16)       160         tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
stream_1 (Stream)               (1, 1, 36, 16)       3856        stream[0][0]                     
__________________________________________________________________________________________________
reshape (Reshape)               (1, 1, 576)          0           stream_1[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/Squ [(1, 576)]           0           reshape[0][0]                    
__________________________________________________________________________________________________
gru_1input_state (InputLayer)   [(1, 256)]           0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/Squee
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256), (1, 256), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256), (1, 256), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
gru_1 (GRU)                     (1, 1, 256)          640512      reshape[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream_2 (Stream)               (1, 256)             0           gru_1[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dropout (Dropout)               (1, 256)             0           stream_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dense (Dense)                   (1, 128)             32896       dropout[0][0]                    
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 3, 40, 1)]      0                                            
__________________________________________________________________________________________________
stream_1/input_state (InputLaye [(1, 5, 38, 16)]     0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream_2/input_state (InputLaye [(1, 1, 256)]        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 256)             33024       dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 2, 40, 1)]      0           stream/input_state[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 4, 38, 16)]     0           stream_1/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 0, 256)]        0           stream_2/input_state[0][0]       
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 14)              3598        dense_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 3, 40, 1)]      0           tf_op_layer_streaming/stream/stri
                                                                 tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 5, 38, 16)]     0           tf_op_layer_streaming/stream_1/st
                                                                 stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 1, 256)]        0           tf_op_layer_streaming/stream_2/st
                                                                 gru_1[0][0]                      
==================================================================================================
Total params: 714,046
Trainable params: 714,046
Non-trainable params: 0
__________________________________________________________________________________________________