Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 320)]           0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 1, 13)           0           input_audio[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (1, 1, 64)           896         speech_features[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 1, 128)          8320        dense[0][0]                      
__________________________________________________________________________________________________
stream (Stream)                 (1, 6272)            0           dense_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 6272, 1)         0           stream[0][0]                     
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (1, 3136, 1)         0           tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_Squeeze (TensorFlow (1, 3136)            0           max_pooling1d[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (1, 3136)            0           tf_op_layer_Squeeze[0][0]        
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 128)             401536      dropout[0][0]                    
__________________________________________________________________________________________________
data_frame_1input_state (InputL [(1, 640)]           0                                            
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 49, 128)]       0                                            
__________________________________________________________________________________________________
dense_3 (Dense)                 (1, 256)             33024       dense_2[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/speech_fe [(1, 320)]           0           data_frame_1input_state[0][0]    
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 48, 128)]       0           stream/input_state[0][0]         
__________________________________________________________________________________________________
dense_4 (Dense)                 (1, 14)              3598        dense_3[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/speech_fe [(1, 640)]           0           tf_op_layer_streaming/speech_feat
                                                                 input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 49, 128)]       0           tf_op_layer_streaming/stream/stri
                                                                 dense_1[0][0]                    
==================================================================================================
Total params: 447,374
Trainable params: 447,374
Non-trainable params: 0
__________________________________________________________________________________________________