Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 49, 40)]             0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 49, 1, 40)            0         
_________________________________________________________________
conv2d (Conv2D)              (1, 24, 1, 32)            3840      
_________________________________________________________________
batch_normalization (BatchNo (1, 24, 1, 32)            128       
_________________________________________________________________
re_lu (ReLU)                 (1, 24, 1, 32)            0         
_________________________________________________________________
depthwise_conv2d (DepthwiseC (1, 11, 1, 32)            96        
_________________________________________________________________
batch_normalization_1 (Batch (1, 11, 1, 32)            128       
_________________________________________________________________
re_lu_1 (ReLU)               (1, 11, 1, 32)            0         
_________________________________________________________________
conv2d_1 (Conv2D)            (1, 11, 1, 32)            1024      
_________________________________________________________________
batch_normalization_2 (Batch (1, 11, 1, 32)            128       
_________________________________________________________________
re_lu_2 (ReLU)               (1, 11, 1, 32)            0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (1, 5, 1, 32)             96        
_________________________________________________________________
batch_normalization_3 (Batch (1, 5, 1, 32)             128       
_________________________________________________________________
re_lu_3 (ReLU)               (1, 5, 1, 32)             0         
_________________________________________________________________
conv2d_2 (Conv2D)            (1, 5, 1, 64)             2048      
_________________________________________________________________
batch_normalization_4 (Batch (1, 5, 1, 64)             256       
_________________________________________________________________
re_lu_4 (ReLU)               (1, 5, 1, 64)             0         
_________________________________________________________________
depthwise_conv2d_2 (Depthwis (1, 5, 1, 64)             192       
_________________________________________________________________
batch_normalization_5 (Batch (1, 5, 1, 64)             256       
_________________________________________________________________
re_lu_5 (ReLU)               (1, 5, 1, 64)             0         
_________________________________________________________________
conv2d_3 (Conv2D)            (1, 5, 1, 128)            8192      
_________________________________________________________________
batch_normalization_6 (Batch (1, 5, 1, 128)            512       
_________________________________________________________________
re_lu_6 (ReLU)               (1, 5, 1, 128)            0         
_________________________________________________________________
depthwise_conv2d_3 (Depthwis (1, 5, 1, 128)            384       
_________________________________________________________________
batch_normalization_7 (Batch (1, 5, 1, 128)            512       
_________________________________________________________________
re_lu_7 (ReLU)               (1, 5, 1, 128)            0         
_________________________________________________________________
conv2d_4 (Conv2D)            (1, 5, 1, 128)            16384     
_________________________________________________________________
batch_normalization_8 (Batch (1, 5, 1, 128)            512       
_________________________________________________________________
re_lu_8 (ReLU)               (1, 5, 1, 128)            0         
_________________________________________________________________
global_average_pooling2d (Gl (1, 128)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 128)                  0         
_________________________________________________________________
dense (Dense)                (1, 14)                   1806      
=================================================================
Total params: 36,622
Trainable params: 35,342
Non-trainable params: 1,280
_________________________________________________________________