Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(1, 49, 13)]             0         
_________________________________________________________________
gru (GRU)                    (1, 1, 400)               498000    
_________________________________________________________________
stream (Stream)              (1, 400)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 400)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  51328     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 585,950
Trainable params: 585,950
Non-trainable params: 0
_________________________________________________________________