Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 49, 40)]           0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(100, 49, 40, 1)]        0         
_________________________________________________________________
stream (Stream)              (100, 47, 38, 16)         160       
_________________________________________________________________
stream_1 (Stream)            (100, 43, 36, 16)         3856      
_________________________________________________________________
reshape (Reshape)            (100, 43, 576)            0         
_________________________________________________________________
gru (GRU)                    (100, 1, 256)             640512    
_________________________________________________________________
stream_2 (Stream)            (100, 256)                0         
_________________________________________________________________
dropout (Dropout)            (100, 256)                0         
_________________________________________________________________
dense (Dense)                (100, 128)                32896     
_________________________________________________________________
dense_1 (Dense)              (100, 256)                33024     
_________________________________________________________________
dense_2 (Dense)              (100, 14)                 3598      
=================================================================
Total params: 714,046
Trainable params: 714,046
Non-trainable params: 0
_________________________________________________________________