Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 49, 40)]           0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(100, 49, 40, 1)]        0         
_________________________________________________________________
stream (Stream)              (100, 45, 38, 300)        3000      
_________________________________________________________________
batch_normalization (BatchNo (100, 45, 38, 300)        900       
_________________________________________________________________
activation (Activation)      (100, 45, 38, 300)        0         
_________________________________________________________________
stream_1 (Stream)            (100, 43, 36, 300)        3000      
_________________________________________________________________
batch_normalization_1 (Batch (100, 43, 36, 300)        900       
_________________________________________________________________
activation_1 (Activation)    (100, 43, 36, 300)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (100, 43, 36, 300)        90300     
_________________________________________________________________
batch_normalization_2 (Batch (100, 43, 36, 300)        900       
_________________________________________________________________
activation_2 (Activation)    (100, 43, 36, 300)        0         
_________________________________________________________________
stream_2 (Stream)            (100, 39, 32, 300)        3000      
_________________________________________________________________
batch_normalization_3 (Batch (100, 39, 32, 300)        900       
_________________________________________________________________
activation_3 (Activation)    (100, 39, 32, 300)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (100, 39, 32, 300)        90300     
_________________________________________________________________
batch_normalization_4 (Batch (100, 39, 32, 300)        900       
_________________________________________________________________
activation_4 (Activation)    (100, 39, 32, 300)        0         
_________________________________________________________________
stream_3 (Stream)            (100, 30, 30, 300)        9300      
_________________________________________________________________
batch_normalization_5 (Batch (100, 30, 30, 300)        900       
_________________________________________________________________
activation_5 (Activation)    (100, 30, 30, 300)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (100, 30, 30, 300)        90300     
_________________________________________________________________
batch_normalization_6 (Batch (100, 30, 30, 300)        900       
_________________________________________________________________
activation_6 (Activation)    (100, 30, 30, 300)        0         
_________________________________________________________________
stream_4 (Stream)            (100, 22, 26, 300)        4800      
_________________________________________________________________
batch_normalization_7 (Batch (100, 22, 26, 300)        900       
_________________________________________________________________
activation_7 (Activation)    (100, 22, 26, 300)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (100, 22, 26, 300)        90300     
_________________________________________________________________
batch_normalization_8 (Batch (100, 22, 26, 300)        900       
_________________________________________________________________
activation_8 (Activation)    (100, 22, 26, 300)        0         
_________________________________________________________________
stream_5 (Stream)            (100, 13, 24, 300)        9300      
_________________________________________________________________
batch_normalization_9 (Batch (100, 13, 24, 300)        900       
_________________________________________________________________
activation_9 (Activation)    (100, 13, 24, 300)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (100, 13, 24, 300)        90300     
_________________________________________________________________
batch_normalization_10 (Batc (100, 13, 24, 300)        900       
_________________________________________________________________
activation_10 (Activation)   (100, 13, 24, 300)        0         
_________________________________________________________________
stream_6 (Stream)            (100, 1, 1, 300)          0         
_________________________________________________________________
stream_7 (Stream)            (100, 300)                0         
_________________________________________________________________
dropout (Dropout)            (100, 300)                0         
_________________________________________________________________
dense (Dense)                (100, 12)                 3612      
=================================================================
Total params: 497,412
Trainable params: 490,812
Non-trainable params: 6,600
_________________________________________________________________