Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 49, 40)]           0         
_________________________________________________________________
lstm (LSTM)                  (100, 1, 200)             583500    
_________________________________________________________________
stream (Stream)              (100, 200)                0         
_________________________________________________________________
dropout (Dropout)            (100, 200)                0         
_________________________________________________________________
dense (Dense)                (100, 14)                 2814      
=================================================================
Total params: 586,314
Trainable params: 586,314
Non-trainable params: 0
_________________________________________________________________