Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 49, 40)]             0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 1, 200)               583500    
_________________________________________________________________
stream (Stream)              (1, 200)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 200)                  0         
_________________________________________________________________
dense (Dense)                (1, 14)                   2814      
=================================================================
Total params: 586,314
Trainable params: 586,314
Non-trainable params: 0
_________________________________________________________________