Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(100, 16000)]       0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (100, 49, 13)        0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF [(100, 49, 1, 13)]   0           speech_features[0][0]            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (100, 45, 1, 24)     1560        tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (100, 45, 1, 24)     72          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (100, 45, 1, 24)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (100, 45, 1, 10)     240         activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (100, 45, 1, 10)     30          conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (100, 45, 1, 10)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (100, 45, 1, 10)     240         activation[0][0]                 
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (100, 45, 1, 10)     500         activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (100, 45, 1, 10)     30          conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (100, 45, 1, 10)     30          conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (100, 45, 1, 10)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (100, 45, 1, 10)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (100, 45, 1, 10)     240         activation[0][0]                 
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (100, 45, 1, 10)     500         activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (100, 45, 1, 10)     500         activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (100, 45, 1, 10)     30          conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (100, 45, 1, 10)     30          conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (100, 45, 1, 10)     30          conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (100, 45, 1, 10)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (100, 45, 1, 10)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (100, 45, 1, 10)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (100, 45, 1, 30)     0           activation_1[0][0]               
                                                                 activation_3[0][0]               
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (100, 45, 1, 10)     300         concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (100, 45, 1, 10)     30          conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (100, 45, 1, 10)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (100, 22, 1, 10)     0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (100, 22, 1, 10)     100         max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (100, 22, 1, 10)     30          conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (100, 22, 1, 10)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (100, 22, 1, 10)     100         max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (100, 22, 1, 10)     500         activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (100, 22, 1, 10)     30          conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (100, 22, 1, 10)     30          conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (100, 22, 1, 10)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_12 (Activation)      (100, 22, 1, 10)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (100, 22, 1, 10)     100         max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (100, 22, 1, 10)     500         activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (100, 22, 1, 10)     500         activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (100, 22, 1, 10)     30          conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (100, 22, 1, 10)     30          conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (100, 22, 1, 10)     30          conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (100, 22, 1, 10)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (100, 22, 1, 10)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (100, 22, 1, 10)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (100, 22, 1, 30)     0           activation_8[0][0]               
                                                                 activation_10[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (100, 22, 1, 10)     300         concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (100, 22, 1, 10)     30          conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (100, 22, 1, 10)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (100, 10, 1, 10)     0           activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (100, 10, 1, 16)     160         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (100, 10, 1, 16)     48          conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (100, 10, 1, 16)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (100, 10, 1, 16)     160         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (100, 10, 1, 16)     1280        activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (100, 10, 1, 16)     48          conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (100, 10, 1, 16)     48          conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (100, 10, 1, 16)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (100, 10, 1, 16)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (100, 10, 1, 16)     160         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (100, 10, 1, 16)     1280        activation_16[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (100, 10, 1, 16)     1280        activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (100, 10, 1, 16)     48          conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (100, 10, 1, 16)     48          conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (100, 10, 1, 16)     48          conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (100, 10, 1, 16)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (100, 10, 1, 16)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (100, 10, 1, 16)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (100, 10, 1, 48)     0           activation_15[0][0]              
                                                                 activation_17[0][0]              
                                                                 activation_20[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (100, 10, 1, 16)     768         concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (100, 10, 1, 16)     48          conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (100, 10, 1, 16)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (100, 16)            0           activation_21[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (100, 16)            0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (100, 14)            238         dropout[0][0]                    
==================================================================================================
Total params: 12,334
Trainable params: 11,782
Non-trainable params: 552
__________________________________________________________________________________________________