Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 25, 20)]           0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(100, 25, 20, 1)]        0         
_________________________________________________________________
stream (Stream)              (100, 23, 18, 64)         640       
_________________________________________________________________
stream_1 (Stream)            (100, 19, 16, 64)         61504     
_________________________________________________________________
stream_2 (Stream)            (100, 15, 14, 64)         61504     
_________________________________________________________________
stream_3 (Stream)            (100, 11, 12, 64)         61504     
_________________________________________________________________
stream_4 (Stream)            (100, 7, 11, 128)         82048     
_________________________________________________________________
stream_5 (Stream)            (100, 3, 11, 64)          41024     
_________________________________________________________________
stream_6 (Stream)            (100, 1, 11, 128)         24704     
_________________________________________________________________
stream_7 (Stream)            (100, 1408)               0         
_________________________________________________________________
dropout (Dropout)            (100, 1408)               0         
_________________________________________________________________
dense (Dense)                (100, 128)                180352    
_________________________________________________________________
dense_1 (Dense)              (100, 256)                33024     
_________________________________________________________________
dense_2 (Dense)              (100, 14)                 3598      
=================================================================
Total params: 549,902
Trainable params: 549,902
Non-trainable params: 0
_________________________________________________________________