Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 1, 13)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/Squ [(1, 13)]            0           input_audio[0][0]                
__________________________________________________________________________________________________
gru_1input_state (InputLayer)   [(1, 400)]           0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 1200)]          0           tf_op_layer_streaming/gru_1/Squee
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 1200)]          0           gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 1200)]          0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 1200)]          0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400), (1, 400), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400), (1, 400), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
gru_1 (GRU)                     (1, 1, 400)          498000      input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream (Stream)                 (1, 400)             0           gru_1[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dropout (Dropout)               (1, 400)             0           stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dense (Dense)                   (1, 128)             51328       dropout[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 1, 400)]        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 256)             33024       dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 0, 400)]        0           stream/input_state[0][0]         
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 14)              3598        dense_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 400)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 1, 400)]        0           tf_op_layer_streaming/stream/stri
                                                                 gru_1[0][0]                      
==================================================================================================
Total params: 585,950
Trainable params: 585,950
Non-trainable params: 0
__________________________________________________________________________________________________