Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 1, 20)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 1, 20, 1)        0           input_audio[0][0]                
__________________________________________________________________________________________________
stream (Stream)                 (1, 1, 18, 64)       640         tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
stream_1 (Stream)               (1, 1, 16, 64)       61504       stream[0][0]                     
__________________________________________________________________________________________________
stream_2 (Stream)               (1, 1, 14, 64)       61504       stream_1[0][0]                   
__________________________________________________________________________________________________
stream_3 (Stream)               (1, 1, 12, 64)       61504       stream_2[0][0]                   
__________________________________________________________________________________________________
stream_4 (Stream)               (1, 1, 11, 128)      82048       stream_3[0][0]                   
__________________________________________________________________________________________________
stream_5 (Stream)               (1, 1, 11, 64)       41024       stream_4[0][0]                   
__________________________________________________________________________________________________
stream_6 (Stream)               (1, 1, 11, 128)      24704       stream_5[0][0]                   
__________________________________________________________________________________________________
stream_7 (Stream)               (1, 1408)            0           stream_6[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (1, 1408)            0           stream_7[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (1, 128)             180352      dropout[0][0]                    
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 3, 20, 1)]      0                                            
__________________________________________________________________________________________________
stream_1/input_state (InputLaye [(1, 5, 18, 64)]     0                                            
__________________________________________________________________________________________________
stream_2/input_state (InputLaye [(1, 5, 16, 64)]     0                                            
__________________________________________________________________________________________________
stream_3/input_state (InputLaye [(1, 5, 14, 64)]     0                                            
__________________________________________________________________________________________________
stream_4/input_state (InputLaye [(1, 5, 12, 64)]     0                                            
__________________________________________________________________________________________________
stream_5/input_state (InputLaye [(1, 5, 11, 128)]    0                                            
__________________________________________________________________________________________________
stream_6/input_state (InputLaye [(1, 3, 11, 64)]     0                                            
__________________________________________________________________________________________________
stream_7/input_state (InputLaye [(1, 1, 11, 128)]    0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 256)             33024       dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 2, 20, 1)]      0           stream/input_state[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 4, 18, 64)]     0           stream_1/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 4, 16, 64)]     0           stream_2/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_3/ [(1, 4, 14, 64)]     0           stream_3/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_4/ [(1, 4, 12, 64)]     0           stream_4/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_5/ [(1, 4, 11, 128)]    0           stream_5/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_6/ [(1, 2, 11, 64)]     0           stream_6/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_7/ [(1, 0, 11, 128)]    0           stream_7/input_state[0][0]       
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 14)              3598        dense_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 3, 20, 1)]      0           tf_op_layer_streaming/stream/stri
                                                                 tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 5, 18, 64)]     0           tf_op_layer_streaming/stream_1/st
                                                                 stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 5, 16, 64)]     0           tf_op_layer_streaming/stream_2/st
                                                                 stream_1[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_3/ [(1, 5, 14, 64)]     0           tf_op_layer_streaming/stream_3/st
                                                                 stream_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_4/ [(1, 5, 12, 64)]     0           tf_op_layer_streaming/stream_4/st
                                                                 stream_3[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_5/ [(1, 5, 11, 128)]    0           tf_op_layer_streaming/stream_5/st
                                                                 stream_4[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_6/ [(1, 3, 11, 64)]     0           tf_op_layer_streaming/stream_6/st
                                                                 stream_5[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_7/ [(1, 1, 11, 128)]    0           tf_op_layer_streaming/stream_7/st
                                                                 stream_6[0][0]                   
==================================================================================================
Total params: 549,902
Trainable params: 549,902
Non-trainable params: 0
__________________________________________________________________________________________________