Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 1, 40)]              0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 1, 40, 1)             0         
_________________________________________________________________
stream (Stream)              (1, 1, 38, 16)            280       
_________________________________________________________________
stream_1 (Stream)            (1, 1, 36, 16)            6896      
_________________________________________________________________
reshape (Reshape)            (1, 1, 576)               0         
_________________________________________________________________
gru_1 (GRU)                  (1, 1, 256)               640768    
_________________________________________________________________
stream_2 (Stream)            (1, 256)                  256       
_________________________________________________________________
dropout (Dropout)            (1, 256)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  32896     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 717,718
Trainable params: 714,046
Non-trainable params: 3,672
_________________________________________________________________