Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(100, 16000)]            0         
_________________________________________________________________
speech_features (SpeechFeatu (100, 49, 13)             0         
_________________________________________________________________
dense (Dense)                (100, 49, 64)             896       
_________________________________________________________________
dense_1 (Dense)              (100, 49, 128)            8320      
_________________________________________________________________
stream (Stream)              (100, 6272)               0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(100, 6272, 1)]          0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (100, 3136, 1)            0         
_________________________________________________________________
tf_op_layer_Squeeze (TensorF [(100, 3136)]             0         
_________________________________________________________________
dropout (Dropout)            (100, 3136)               0         
_________________________________________________________________
dense_2 (Dense)              (100, 128)                401536    
_________________________________________________________________
dense_3 (Dense)              (100, 256)                33024     
_________________________________________________________________
dense_4 (Dense)              (100, 14)                 3598      
=================================================================
Total params: 447,374
Trainable params: 447,374
Non-trainable params: 0
_________________________________________________________________