Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 320)]                0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 1, 13)                640       
_________________________________________________________________
dense (Dense)                (1, 1, 64)                896       
_________________________________________________________________
dense_1 (Dense)              (1, 1, 128)               8320      
_________________________________________________________________
stream (Stream)              (1, 6272)                 6272      
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 6272, 1)              0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (1, 3136, 1)              0         
_________________________________________________________________
tf_op_layer_Squeeze (TensorF (1, 3136)                 0         
_________________________________________________________________
dropout (Dropout)            (1, 3136)                 0         
_________________________________________________________________
dense_2 (Dense)              (1, 128)                  401536    
_________________________________________________________________
dense_3 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_4 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 454,286
Trainable params: 447,374
Non-trainable params: 6,912
_________________________________________________________________