Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 1, 40)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/Sq [(1, 40)]            0           input_audio[0][0]                
__________________________________________________________________________________________________
lstm_1input_state2 (InputLayer) [(1, 200)]           0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 240)]           0           tf_op_layer_streaming/lstm_1/Sque
                                                                 lstm_1input_state2[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 2000)]          0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 2000)]          0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500), (1, 500), 0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
lstm_1input_state1 (InputLayer) [(1, 500)]           0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           lstm_1input_state1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           lstm_1input_state1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 lstm_1input_state1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (1, 1, 200)          583500      input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
stream (Stream)                 (1, 200)             0           lstm_1[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 1, 200)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (1, 200)             0           stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 500)]           0           tf_op_layer_streaming/lstm_1/lstm
                                                                 tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 0, 200)]        0           stream/input_state[0][0]         
__________________________________________________________________________________________________
dense (Dense)                   (1, 14)              2814        dropout[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/lstm_1/ls [(1, 200)]           0           tf_op_layer_streaming/lstm_1/lstm
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 1, 200)]        0           tf_op_layer_streaming/stream/stri
                                                                 lstm_1[0][0]                     
==================================================================================================
Total params: 586,314
Trainable params: 586,314
Non-trainable params: 0
__________________________________________________________________________________________________