Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 1, 40)]              0         
_________________________________________________________________
lstm_1 (LSTM)                (1, 1, 200)               584200    
_________________________________________________________________
stream (Stream)              (1, 200)                  200       
_________________________________________________________________
dropout (Dropout)            (1, 200)                  0         
_________________________________________________________________
dense (Dense)                (1, 14)                   2814      
=================================================================
Total params: 587,214
Trainable params: 586,314
Non-trainable params: 900
_________________________________________________________________