Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 49, 13)               0         
_________________________________________________________________
dense (Dense)                (1, 49, 64)               896       
_________________________________________________________________
dense_1 (Dense)              (1, 49, 128)              8320      
_________________________________________________________________
stream (Stream)              (1, 6272)                 0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 6272, 1)              0         
_________________________________________________________________
max_pooling1d (MaxPooling1D) (1, 3136, 1)              0         
_________________________________________________________________
tf_op_layer_Squeeze (TensorF (1, 3136)                 0         
_________________________________________________________________
dropout (Dropout)            (1, 3136)                 0         
_________________________________________________________________
dense_2 (Dense)              (1, 128)                  401536    
_________________________________________________________________
dense_3 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_4 (Dense)              (1, 14)                   3598      
=================================================================
Total params: 447,374
Trainable params: 447,374
Non-trainable params: 0
_________________________________________________________________