Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(300, 49, 32)]           0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(300, 49, 32, 1)]        0         
_________________________________________________________________
stream (Stream)              (300, 45, 30, 300)        3000      
_________________________________________________________________
activation (Activation)      (300, 45, 30, 300)        0         
_________________________________________________________________
batch_normalization (BatchNo (300, 45, 30, 300)        900       
_________________________________________________________________
stream_1 (Stream)            (300, 43, 28, 300)        3000      
_________________________________________________________________
activation_1 (Activation)    (300, 43, 28, 300)        0         
_________________________________________________________________
batch_normalization_1 (Batch (300, 43, 28, 300)        900       
_________________________________________________________________
conv2d_1 (Conv2D)            (300, 43, 28, 300)        90300     
_________________________________________________________________
activation_2 (Activation)    (300, 43, 28, 300)        0         
_________________________________________________________________
batch_normalization_2 (Batch (300, 43, 28, 300)        900       
_________________________________________________________________
stream_2 (Stream)            (300, 39, 24, 300)        3000      
_________________________________________________________________
activation_3 (Activation)    (300, 39, 24, 300)        0         
_________________________________________________________________
batch_normalization_3 (Batch (300, 39, 24, 300)        900       
_________________________________________________________________
conv2d_2 (Conv2D)            (300, 39, 24, 300)        90300     
_________________________________________________________________
activation_4 (Activation)    (300, 39, 24, 300)        0         
_________________________________________________________________
batch_normalization_4 (Batch (300, 39, 24, 300)        900       
_________________________________________________________________
stream_3 (Stream)            (300, 30, 22, 300)        9300      
_________________________________________________________________
activation_5 (Activation)    (300, 30, 22, 300)        0         
_________________________________________________________________
batch_normalization_5 (Batch (300, 30, 22, 300)        900       
_________________________________________________________________
conv2d_3 (Conv2D)            (300, 30, 22, 300)        90300     
_________________________________________________________________
activation_6 (Activation)    (300, 30, 22, 300)        0         
_________________________________________________________________
batch_normalization_6 (Batch (300, 30, 22, 300)        900       
_________________________________________________________________
stream_4 (Stream)            (300, 22, 18, 300)        4800      
_________________________________________________________________
activation_7 (Activation)    (300, 22, 18, 300)        0         
_________________________________________________________________
batch_normalization_7 (Batch (300, 22, 18, 300)        900       
_________________________________________________________________
conv2d_4 (Conv2D)            (300, 22, 18, 300)        90300     
_________________________________________________________________
activation_8 (Activation)    (300, 22, 18, 300)        0         
_________________________________________________________________
batch_normalization_8 (Batch (300, 22, 18, 300)        900       
_________________________________________________________________
stream_5 (Stream)            (300, 13, 16, 300)        9300      
_________________________________________________________________
activation_9 (Activation)    (300, 13, 16, 300)        0         
_________________________________________________________________
batch_normalization_9 (Batch (300, 13, 16, 300)        900       
_________________________________________________________________
conv2d_5 (Conv2D)            (300, 13, 16, 300)        90300     
_________________________________________________________________
activation_10 (Activation)   (300, 13, 16, 300)        0         
_________________________________________________________________
batch_normalization_10 (Batc (300, 13, 16, 300)        900       
_________________________________________________________________
stream_6 (Stream)            (300, 1, 1, 300)          0         
_________________________________________________________________
stream_7 (Stream)            (300, 300)                0         
_________________________________________________________________
dropout (Dropout)            (300, 300)                0         
_________________________________________________________________
dense (Dense)                (300, 14)                 4214      
=================================================================
Total params: 498,014
Trainable params: 491,414
Non-trainable params: 6,600
_________________________________________________________________