Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 1, 40)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 1, 40, 1)        0           input_audio[0][0]                
__________________________________________________________________________________________________
stream (Stream)                 (1, 1, 38, 300)      3000        tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (1, 1, 38, 300)      900         stream[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (1, 1, 38, 300)      0           batch_normalization[0][0]        
__________________________________________________________________________________________________
stream_1 (Stream)               (1, 1, 36, 300)      3000        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (1, 1, 36, 300)      900         stream_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (1, 1, 36, 300)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (1, 1, 36, 300)      90300       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (1, 1, 36, 300)      900         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (1, 1, 36, 300)      0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
stream_2 (Stream)               (1, 1, 32, 300)      3000        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (1, 1, 32, 300)      900         stream_2[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (1, 1, 32, 300)      0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (1, 1, 32, 300)      90300       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (1, 1, 32, 300)      900         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (1, 1, 32, 300)      0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
stream_3 (Stream)               (1, 1, 30, 300)      9300        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (1, 1, 30, 300)      900         stream_3[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (1, 1, 30, 300)      0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (1, 1, 30, 300)      90300       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (1, 1, 30, 300)      900         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (1, 1, 30, 300)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
stream_4 (Stream)               (1, 1, 26, 300)      4800        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (1, 1, 26, 300)      900         stream_4[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (1, 1, 26, 300)      0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (1, 1, 26, 300)      90300       activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (1, 1, 26, 300)      900         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (1, 1, 26, 300)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
stream_5 (Stream)               (1, 1, 24, 300)      9300        activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (1, 1, 24, 300)      900         stream_5[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (1, 1, 24, 300)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (1, 1, 24, 300)      90300       activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (1, 1, 24, 300)      900         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (1, 1, 24, 300)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
stream_6 (Stream)               (1, 1, 1, 300)       0           activation_10[0][0]              
__________________________________________________________________________________________________
stream_7 (Stream)               (1, 300)             0           stream_6[0][0]                   
__________________________________________________________________________________________________
stream/input_state (InputLayer) [(1, 5, 40, 1)]      0                                            
__________________________________________________________________________________________________
stream_1/input_state (InputLaye [(1, 3, 38, 300)]    0                                            
__________________________________________________________________________________________________
stream_2/input_state (InputLaye [(1, 5, 36, 300)]    0                                            
__________________________________________________________________________________________________
stream_3/input_state (InputLaye [(1, 10, 32, 300)]   0                                            
__________________________________________________________________________________________________
stream_4/input_state (InputLaye [(1, 9, 30, 300)]    0                                            
__________________________________________________________________________________________________
stream_5/input_state (InputLaye [(1, 10, 26, 300)]   0                                            
__________________________________________________________________________________________________
stream_6/input_state (InputLaye [(1, 13, 24, 300)]   0                                            
__________________________________________________________________________________________________
stream_7/input_state (InputLaye [(1, 1, 1, 300)]     0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (1, 300)             0           stream_7[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 4, 40, 1)]      0           stream/input_state[0][0]         
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 2, 38, 300)]    0           stream_1/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 4, 36, 300)]    0           stream_2/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_3/ [(1, 9, 32, 300)]    0           stream_3/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_4/ [(1, 8, 30, 300)]    0           stream_4/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_5/ [(1, 9, 26, 300)]    0           stream_5/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_6/ [(1, 12, 24, 300)]   0           stream_6/input_state[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_7/ [(1, 0, 1, 300)]     0           stream_7/input_state[0][0]       
__________________________________________________________________________________________________
dense (Dense)                   (1, 14)              4214        dropout[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 5, 40, 1)]      0           tf_op_layer_streaming/stream/stri
                                                                 tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 3, 38, 300)]    0           tf_op_layer_streaming/stream_1/st
                                                                 activation[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 5, 36, 300)]    0           tf_op_layer_streaming/stream_2/st
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_3/ [(1, 10, 32, 300)]   0           tf_op_layer_streaming/stream_3/st
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_4/ [(1, 9, 30, 300)]    0           tf_op_layer_streaming/stream_4/st
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_5/ [(1, 10, 26, 300)]   0           tf_op_layer_streaming/stream_5/st
                                                                 activation_8[0][0]               
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_6/ [(1, 13, 24, 300)]   0           tf_op_layer_streaming/stream_6/st
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_7/ [(1, 1, 1, 300)]     0           tf_op_layer_streaming/stream_7/st
                                                                 stream_6[0][0]                   
==================================================================================================
Total params: 498,014
Trainable params: 491,414
Non-trainable params: 6,600
__________________________________________________________________________________________________