Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(1, 49, 40)]             0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(1, 49, 40, 1)]          0         
_________________________________________________________________
stream (Stream)              (1, 45, 38, 300)          3000      
_________________________________________________________________
batch_normalization (BatchNo (1, 45, 38, 300)          900       
_________________________________________________________________
activation (Activation)      (1, 45, 38, 300)          0         
_________________________________________________________________
stream_1 (Stream)            (1, 43, 36, 300)          3000      
_________________________________________________________________
batch_normalization_1 (Batch (1, 43, 36, 300)          900       
_________________________________________________________________
activation_1 (Activation)    (1, 43, 36, 300)          0         
_________________________________________________________________
conv2d_1 (Conv2D)            (1, 43, 36, 300)          90300     
_________________________________________________________________
batch_normalization_2 (Batch (1, 43, 36, 300)          900       
_________________________________________________________________
activation_2 (Activation)    (1, 43, 36, 300)          0         
_________________________________________________________________
stream_2 (Stream)            (1, 39, 32, 300)          3000      
_________________________________________________________________
batch_normalization_3 (Batch (1, 39, 32, 300)          900       
_________________________________________________________________
activation_3 (Activation)    (1, 39, 32, 300)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (1, 39, 32, 300)          90300     
_________________________________________________________________
batch_normalization_4 (Batch (1, 39, 32, 300)          900       
_________________________________________________________________
activation_4 (Activation)    (1, 39, 32, 300)          0         
_________________________________________________________________
stream_3 (Stream)            (1, 30, 30, 300)          9300      
_________________________________________________________________
batch_normalization_5 (Batch (1, 30, 30, 300)          900       
_________________________________________________________________
activation_5 (Activation)    (1, 30, 30, 300)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (1, 30, 30, 300)          90300     
_________________________________________________________________
batch_normalization_6 (Batch (1, 30, 30, 300)          900       
_________________________________________________________________
activation_6 (Activation)    (1, 30, 30, 300)          0         
_________________________________________________________________
stream_4 (Stream)            (1, 22, 26, 300)          4800      
_________________________________________________________________
batch_normalization_7 (Batch (1, 22, 26, 300)          900       
_________________________________________________________________
activation_7 (Activation)    (1, 22, 26, 300)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (1, 22, 26, 300)          90300     
_________________________________________________________________
batch_normalization_8 (Batch (1, 22, 26, 300)          900       
_________________________________________________________________
activation_8 (Activation)    (1, 22, 26, 300)          0         
_________________________________________________________________
stream_5 (Stream)            (1, 13, 24, 300)          9300      
_________________________________________________________________
batch_normalization_9 (Batch (1, 13, 24, 300)          900       
_________________________________________________________________
activation_9 (Activation)    (1, 13, 24, 300)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (1, 13, 24, 300)          90300     
_________________________________________________________________
batch_normalization_10 (Batc (1, 13, 24, 300)          900       
_________________________________________________________________
activation_10 (Activation)   (1, 13, 24, 300)          0         
_________________________________________________________________
stream_6 (Stream)            (1, 1, 1, 300)            0         
_________________________________________________________________
stream_7 (Stream)            (1, 300)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 300)                  0         
_________________________________________________________________
dense (Dense)                (1, 14)                   4214      
=================================================================
Total params: 498,014
Trainable params: 491,414
Non-trainable params: 6,600
_________________________________________________________________